from django.db import models
from django.utils.translation import gettext_lazy as _

class RTAFUnitSection(models.TextChoices):    
    NotDefine = '0', _('-')
    Commander = '1', _('ส่วนบังคับบัญชา')
    AFHeadquater = '2', _('กองทัพอากาศ (กองบัญชาการ)')
    Headquater = '3', _('ส่วนบัญชาการ')
    Fighter = '4', _('ส่วนกำลังรบ')
    Support = '5', _('ส่วนส่งกำลังบำรุง')
    Education = '6', _('ส่วนการศึกษา')
    Special = '7', _('ส่วนกิจการพิเศษ')


CHOICE_Rank = (
    ( 30101 ,  'พล.อ.อ.*' ) ,
    ( 30102 ,  'พล.อ.อ.*หญิง' ) ,
    ( 30211 ,  'พล.อ.อ.' ) ,
    ( 30212 ,  'พล.อ.อ.หญิง' ) ,
    ( 30213 ,  'พล.อ.' ) ,
    ( 30221 ,  'พล.อ.ท.' ) ,
    ( 30222 ,  'พล.อ.ท.หญิง' ) ,
    ( 30231 ,  'พล.อ.ต.' ) ,
    ( 30232 ,  'พล.อ.ต.หญิง' ) ,
    ( 30301 ,  'น.อ.(พ)' ) ,
    ( 30302 ,  'น.อ.(พ) หญิง' ) ,
    ( 30410 ,  'พ.อ.' ) ,
    ( 30411 ,  'น.อ.' ) ,
    ( 30412 ,  'น.อ.หญิง' ) ,
    ( 30420 ,  'พ.ท.' ) ,
    ( 30421 ,  'น.ท.' ) ,
    ( 30422 ,  'น.ท.หญิง' ) ,
    ( 30431 ,  'น.ต.' ) ,
    ( 30432 ,  'น.ต.หญิง' ) ,
    ( 30511 ,  'ร.อ.' ) ,
    ( 30512 ,  'ร.อ.หญิง' ) ,
    ( 30521 ,  'ร.ท.' ) ,
    ( 30522 ,  'ร.ท.หญิง' ) ,
    ( 30531 ,  'ร.ต.' ) ,
    ( 30532 ,  'ร.ต.หญิง' ) ,
    ( 30541 ,  'กห.ส.' ) ,
    ( 30542 ,  'กห.ส.หญิง' ) ,
    ( 30611 ,  'พ.อ.อ.(พ)' ) ,
    ( 30612 ,  'พ.อ.อ.(พ) หญิง' ) ,
    ( 30711 ,  'พ.อ.อ.' ) ,
    ( 30712 ,  'พ.อ.อ.หญิง' ) ,
    ( 30721 ,  'พ.อ.ท.' ) ,
    ( 30722 ,  'พ.อ.ท.หญิง' ) ,
    ( 30731 ,  'พ.อ.ต.' ) ,
    ( 30732 ,  'พ.อ.ต.หญิง' ) ,
    ( 30811 ,  'จ.อ.' ) ,
    ( 30812 ,  'จ.อ.หญิง' ) ,
    ( 30821 ,  'จ.ท.' ) ,
    ( 30822 ,  'จ.ท.หญิง' ) ,
    ( 30831 ,  'จ.ต.' ) ,
    ( 30832 ,  'จ.ต.หญิง' ) ,
    ( 30841 ,  'กห.ป.' ) ,
    ( 30842 ,  'กห.ป.หญิง' ) ,
    # ( 31411 ,  'น.อ.' ) ,
    # ( 31412 ,  'น.อ.หญิง' ) ,
    # ( 31421 ,  'น.ท.' ) ,
    # ( 31422 ,  'น.ท.หญิง' ) ,
    # ( 31431 ,  'น.ต.' ) ,
    # ( 31432 ,  'น.ต.หญิง' ) ,
    # ( 31511 ,  'ร.อ.' ) ,
    # ( 31512 ,  'ร.อ.หญิง' ) ,
    # ( 31521 ,  'ร.ท.' ) ,
    # ( 31522 ,  'ร.ท.หญิง' ) ,
    # ( 31531 ,  'ร.ต.' ) ,
    # ( 31532 ,  'ร.ต.หญิง' ) ,
    ( 40200 - 1000 ,  'พนง.อาวุโสหญิง' ) ,
    ( 40201 - 1000 ,  'พนง.อาวุโส' ) ,
    ( 40400 - 1000 ,  'พนง.หญิง' ) ,
    ( 40401 - 1000 ,  'พนง.' ) ,
    ( 40600 - 1000 ,  'นาย' ) ,
    ( 40601 - 1000 ,  'นาง' ) ,
    ( 40602 - 1000 ,  'น.ส.' ) ,
    ( 0 ,  '' )
) 

